DML

In [2]:
from mysql import connector

mydb = connector.connect(
    host = "localhost",
    user="root",
    password="root",
    database="debi"
)
cursor = mydb.cursor()
cursor.execute("SHOW DATABASES")

In [3]:
cursor.fetchall()

[('debi',),
 ('debi_2',),
 ('information_schema',),
 ('mydatabase',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [6]:
cursor.execute("SHOW TABLES")
cursor.fetchall()

[('employee',)]

In [7]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[]

In [9]:
cursor.execute("INSERT INTO employee (Name,ID,DOB,Address) VALUES ('Islam Adel','emp123','1993-03-25','Cairo')")

In [10]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Islam Adel', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

In [11]:
cursor.execute("UPDATE employee SET Address='6 October' WHERE ID='emp123'")

In [12]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Islam Adel', 'emp123', datetime.date(1993, 3, 25), '6 October')]

In [42]:
cursor.execute("INSERT INTO employee (Name,ID,DOB,Address) VALUES ('Omar Ehb','emp147','1993-03-25','Cairo')")

In [14]:
cursor.execute("DELETE FROM employee WHERE ID='emp123'")

In [15]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Omar Ehb', 'emp147', datetime.date(1993, 3, 25), 'Cairo')]

DCL

In [16]:
cursor.execute("CREATE USER 'iadel'@'localhost' IDENTIFIED BY 'root'")

In [21]:
cursor.execute("GRANT SELECT,UPDATE on debi.* TO 'iadel'@'localhost'")

In [22]:
mydb.close()

In [23]:
mydb = connector.connect(
    host = 'localhost',
    user = 'iadel',
    password = 'root',
    database = 'debi'
)

In [24]:
cursor = mydb.cursor()
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Omar Ehb', 'emp147', datetime.date(1993, 3, 25), 'Cairo')]

In [34]:
cursor.execute("INSERT INTO employee (Name,ID,DOB,Address) VALUES ('Islam Adel','emp123','1993-03-25','Cairo')")

TCL

In [26]:
mydb.close()

In [1]:
from mysql import connector
mydb = connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'root',
    database = 'debi'
)

In [3]:
cursor = mydb.cursor()
cursor.execute("COMMIT")

In [4]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Islam Adel', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

In [5]:
cursor.execute("DELETE FROM employee WHERE ID='emp123'")

In [6]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[]

In [7]:
cursor.execute("ROLLBACK")

In [8]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Islam Adel', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

In [9]:
cursor.execute("SAVEPOINT save1")

In [13]:
cursor.execute("UPDATE employee SET Name='Ahmed Mohammed' WHERE ID='emp123'")

In [14]:
cursor.execute("SAVEPOINT save2")

In [15]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Ahmed Mohammed', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

In [10]:
cursor.execute("DELETE FROM employee WHERE ID='emp123'")
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[]

In [11]:
cursor.execute("ROLLBACK TO save1")

In [12]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Islam Adel', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

In [16]:
cursor.execute("ROLLBACK TO save2")

In [17]:
cursor.execute("SELECT * FROM employee")
cursor.fetchall()

[('Ahmed Mohammed', 'emp123', datetime.date(1993, 3, 25), 'Cairo')]

Import data from pandas to mysql